{"version": "1.6","name": "Events Calendar Application","subline": "","username": "Wachipi Srl","created": "11/26/2012","website": "http://www.wachipi.com","update": "04/23/2013","update_today": true,"email": "","intro": "","sections": [{"title": "Installation","id": "installation","content": "<p>\t&nbsp;Follow these simple steps and Events Calendar will be fully functional and ready for use.<br>\n\t<br>\n\t<strong>1. Upload the folder &ldquo;events&rdquo; in your server</strong><br>\n\t<br>\n\tIf you like, you can change the folder name &ldquo;events&rdquo;, but it&#39;s important to remember that the internal folders names must not be changed. Also do not move the folder called &ldquo;admin&rdquo;.<br>\n\t<br>\n\t<strong>2. Import in your database the file &ldquo;events.sql&rdquo; that is in the folder events_DB</strong><br>\n\t<br>\n\tBefore importing it is always suggested to make a backup of your database<br>\n\t<br>\n\tThe added tables of Events Calendar will have the prefix events_<br>\n\t<br>\n\t<strong>3. Open the file db_conn.php in the folder events&gt; admin &gt;include and set the connection data of your database</strong><br>\n\t<br>\n\tWell done!<br>\n\t<br>\n\tEvents Calendar was installed properly.<br>\n\t<br>\n\tNow it remains only to set the control panel.<br>\n\t<br>\n\t&nbsp;<strong>4. Sign in to the administrator control panel</strong><br>\n\t<br>\n\tTo go to the login page type the full address where you installed Events Calendar, adding /admin.<br>\n\t<br>\n\tFor example, if you didn&rsquo;t change the folder name, the address will be http://www.yourwebsitehere.com/events/admin<br>\n\t<br>\n\tAccess credentials are<br>\n\t<br>\n\tUser: admin<br>\n\t<br>\n\tPassword: admin</p>\n<p>\t<br>\n\t<strong>5. Go to settings area and set your preferences. You can change them at any time.</strong><br>\n\t<br>\n\tTo see how to configure your settings, go to Settings section<br>\n\t<br>\n\t<strong>6. Create your calendar.</strong><br>\n\t<br>\n\tCongratulations. Now you can start creating events.</p>\n"},{"title": "Settings","id": "settings","content": "<p>\tThis is an important section where all the app&#39;s settings can be managed.<br>\n\t<br>\n\t<strong>Absolute path of Events Calendar installation</strong><br>\n\t<br>\n\tIt&#39;s a very important setting and must be set to make the whole app working. If you do not set, the app won&#39;t work at all.<br>\n\t<br>\n\t<strong>Timezone</strong><br>\n\t<br>\n\tSet your timezone to highlight the right day when visitors load your calendars and to load Twitter data if set.</p>\n<p>\t<strong>Calendar date format</strong></p>\n<p>\tChoose if you prefer to use UK (dd/mm/yyyy and the weeks starting on Monday) or US (mm/dd/yyyy and the weeks starting on Sunday) date format.</p>\n<p>\t<strong>Calendar time format</strong></p>\n<p>\tChoose if you prefer to use 12-hour time format (with am/pm) or 24-hour time format.</p>\n<p>\t<br>\n\t<strong>Twitter approvation</strong></p>\n<p>\tSet this option if you want to monitor Twitter data and prevent spam on the event page.</p>\n<p>\tIf you set it to &quot;YES&quot;, you can also insert an email address to receive the latest tweets to be approved.</p>\n<p>\t<strong>Flickr API Key</strong></p>\n<p>\tFollow Flickr link to get an API Key and set this option if you want to have the chance to show Flickr photos in the event page.</p>\n<p>\t<strong>Available events preview</strong><br>\n\t&nbsp;<br>\n\tThis is just a &quot;graphic&quot; setting. If you want to show <span lang=\"en-GB\">the preview of the available events when visitors are navigating into calendar, check &quot;enabled&quot;</span></p>\n<p>\t<strong>Default view</strong></p>\n<p>\tHere you can choose which view will be the default one when a user lands to your events calendar. Options are between the classic calendar view and the list view.</p>\n<p>\tIf you choose the list view, you can specify if you want to show only future events, past events or all events of the calendar. This option will be also extended to the &quot;List&quot; button.</p>\n<p>\t<strong>Activate mobile version</strong></p>\n<p>\tUsing this option you can activate the mobile version of the Events Calendar. If you activate it when a user lands to your calendar page using a mobile device, he will see the optimized version for mobile devices.</p>\n"},{"title": "Calendars","id": "calendars","content": "<p>\tThis section allow you to view, add, publish, unpublish and delete all your calendars.<br>\n\t<br>\n\tAs you can see you can add more than one calendar. i.e. You have two different location where you usually organize events, you can use two different calendars.<br>\n\t<br>\n\tYou must create at least a calendar item to make the app working.<br>\n\t<br>\n\t<strong>Adding calendars</strong><br>\n\t<br>\n\tIt&#39; s easy to add a calendar, just type the name of your calendar and click &quot;Add&quot;. You&#39;ll see your calendar appearing in the list below. A new calendar is never published when created, because it&#39;s empty, it has no events yet, so it would be useless to show it on the app.<br>\n\t<br>\n\tIf you add more than one calendar, you&#39;ll se a button appearing below the &quot;published/unpublished&quot; icon. There must be a default calendar if you have more than one. The default calendar will be the first appearing when the app is loaded.<br>\n\t<br>\n\t<strong>Modify a calendar name</strong><br>\n\t<br>\n\tTo modify a calendar name, just click on &quot;Modify name&quot; and type the new name, then click on &quot;Save&quot;.<br>\n\t<br>\n\t<strong>Publish/Unpublish calendars</strong><br>\n\t<br>\n\tIt&#39;s easy to publish or unpublish a calendar. If you want to change just one calendar status, you can click on the &quot;published/unpublished&quot; icon and that&#39;s it.<br>\n\t<br>\n\tIf you need to change more than one calendar status, you can select the calendars you want to publish or unpublish and then click on &quot;Publish&quot; or &quot;Unpublish&quot; on the action bar at the top.<br>\n\t<br>\n\tPublishing or unpublishing a calendar, is useful if you need to do some modifications on calendar events and you don&#39;t want people to see that you&#39;re working on it.<br>\n\t<br>\n\t<strong>Delete calendars</strong><br>\n\t<br>\n\tYou can also delete one calendar or more.<br>\n\t<br>\n\tTo delete only one calendar, just click on &quot;Delete&quot; on the corrisponding calendar row. To delete more than one calendar, select the calendars you want to delete and then click on &quot;Delete&quot; on the action bar at the top.<br>\n\t<br>\n\tOnce you&#39;ve deleted a calendar, all related events will be deleted.</p>\n<p>\t<strong>Duplicate calendars</strong></p>\n<p>\tYou can also duplicate existing calendars. Avoid losing time to insert a new calendar and its events by duplicating an already existing one (with all the events). You will always be able to edit the duplicated calendar.</p>\n<p>\t<strong>Manage Events</strong></p>\n<p>\tTo manage your events for each calendar, just click on &quot;Events&quot; on the calendar row for which you want to manage events.</p>\n<p>\tOnce clicked, you&#39;ll find the list of all the events created for that specific calendar. Here you are able to add new events or to modify, publish, unpublish and delete the existing ones.</p>\n<p>\tTo create a new event just click on &quot;Add&quot; on the action bar at the top. A form will open and you&#39;ll be able to insert all the information about the event.</p>\n<p style=\"margin-left: 40px;\">\n\t<strong>Create events</strong></p>\n<p style=\"margin-left: 40px;\">\n\tFirst you&#39;re asked to insert a title for the event (e.g. &quot;Grand meeting&quot;).</p>\n<p style=\"margin-left: 1.01cm; margin-bottom: 0cm\">\n\tThen specify the date of the event. An event can last more than one day, so you can insert &quot;date from&quot; and &quot;date to&quot;. If your event lasts only one day, just fill &quot;date from&quot; field.</p>\n<p style=\"margin-left: 1.01cm; margin-bottom: 0cm\">\n\tYou can also select if it&#39;s a recurring event or not. If it&#39;s a recurring event, you can select one or more days of the week or specific dates on which the event occurs.</p>\n<p style=\"margin-left: 1.01cm; margin-bottom: 0cm\">\n\t<span lang=\"en-GB\">Then you can specify a starting time for your event and the ending time too.</span></p>\n<p style=\"margin-left: 1.01cm; margin-bottom: 0cm\">\n\tIf you want, you can specify times for each day the event lasts. (e.g. the first day, event starts at 10.00 and ends at 13.00 and restarts from 15.00 to 18.00, but on the second day it starts at 15.00 and ends at 19.00 etc.)</p>\n<p style=\"margin-left: 40px;\">\n\tYou can also insert the event venue information.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can optionally add the admission rules, writing all prices for the event or setting it free by clicking on the check below the text field. This information will be shown in the spotlight in the event page.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can also specify if there is a fixed number of available seats or if they are unlimited.</p>\n<p style=\"margin-left: 40px;\">\n\tThen you&#39;ll be able to add a cover photo, which represents the event and you can choose whether to show or not this photo into the event page. By default it will be shown into the event page and events list.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can add a detailed description, a complete gallery of photos, a video, with a text, and a map, with a text, for your event, so people will be able to see how to easily reach the event location.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can also choose to add a link to your online store to allow users to buy tickets for the event and/or a link to a specific website (e.g. the event website).</p>\n<p style=\"margin-left: 40px;\">\n\tThe link for the online store will appear as a button on the right side of the event page, while the website link will be shown on the left side of the event page.</p>\n<p style=\"margin-left: 40px;\">\n\tThen you can insert the Twitter hashtag related to your event, to show the most recent tweets for the event.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can also insert a search string for Flickr, to show the latest pics uploaded on Flickr related to the event.</p>\n<p style=\"margin-left: 40px;\">\n\tLast but not least, you can add metatags for your event page. This will be useful for the search engine optimization (SEO). To know more about metatags <a href=\"http://en.wikipedia.org/wiki/Metatag\">click here</a>, about SEO <a href=\"http://en.wikipedia.org/wiki/Search_engine_optimization\">click here</a> .</p>\n<p style=\"margin-left: 40px;\">\n\tThen, just click on &quot;Save&quot;. You&#39;ll be redirected to the events list.</p>\n<p style=\"margin-left: 40px;\">\n\t<strong>Modify Events</strong></p>\n<p style=\"margin-left: 40px;\">\n\tModifying events is as easy as creating them. Just click on &quot;Modify&quot; on the chosen event row and you&#39;ll be able to modify all the information about it.</p>\n<p style=\"margin-left: 40px;\">\n\t<strong>Publish/Unpublish Events</strong></p>\n<p style=\"margin-left: 40px;\">\n\tPerforming these operations on events is very fast.</p>\n<p style=\"margin-left: 40px;\">\n\tYou can publish/unpublish a single event or more than one at once. To modify a single event status, click on the &quot;published/unpublished&quot; icon on the event row and it&#39;s done, status has been changed.</p>\n<p style=\"margin-left: 40px;\">\n\tIf you want to change status of several events, just select the events for which you want to perform the action and then click on &quot;publish&quot; or &quot;unpublish&quot; on the action bar at the top.</p>\n<p style=\"margin-left: 40px;\">\n\t<strong>Delete Events</strong></p>\n<p style=\"margin-left: 40px;\">\n\tTo delete one or more events, just select the chosen events and click on &quot;delete&quot; on the action bar at the top.</p>\n<p style=\"margin-left: 40px;\">\n\t<strong>Duplicate Events</strong></p>\n<p style=\"margin-left: 40px;\">\n\tYou can also duplicate existing events. If you have a recurrent event or if you plan to organize a similar one, avoid losing time to insert the new event and duplicate the already existing one (with description, photo, location&hellip;). You will always be able to edit the duplicated event.</p>\n"},{"title": "Change admin password","id": "change_admin_password","content": "<p>\tIn this section you can change admin panel access password.</p>\n<p>\tJust type old password, the new password, confirm the new password and click on &quot; Save&quot;.</p>\n"},{"title": "Metatags","id": "metatags","content": "<p>\tIn this section you can edit metatags of your booking calendar application.</p>\n<p>\tFor info about Metatags click here: <a href=\"http://en.wikipedia.org/wiki/Metatag\">http://en.wikipedia.org/wiki/Metatag</a></p>\n<p>\tYou can modify page title (&lt;title&gt; tag), meta title (&lt;meta name=&quot;title&quot;&gt; tag), meta description (&lt;meta name=&quot;description&quot;&gt; tag) and meta keywords (&lt;meta name=&quot;keywords&quot;&gt; tag).</p>\n<h3>\n\t&nbsp;</h3>\n"},{"title": "Twitter management","id": "twitter_management","content": "<p>\t<strong>Twitter spam</strong></p>\n<p>\tHere you can find all Twitter users you marked as spam.</p>\n<p>\tTo remove users from spam list, just click on red icon on the row you want to remove from spam list and it&#39;s done.</p>\n<p>\tTo remove more than one user at once from spam list, just select the chosen users by clicking on the corresponding checkboxes on the left and click &quot;Remove from spam list&quot; in the action bar above.</p>\n<p>\tIn both cases, you&#39;ll be automatically redirected to Twitter approved users list.</p>\n<p>\tTo add a user to the spam list, you can also type the username in the box at the top of the page and then click on &quot;Add&quot;.</p>\n<p>\t<strong>Twitter approval</strong></p>\n<p>\tHere you can find all Twitter users that have made a tweet about your events. If you set the option &quot;Twitter approvation&quot; to &quot;NO&quot; in the settings page, you&#39;ll always see a green icon on the right of the username, which means that the user is approved and his tweets are visible on your events pages.</p>\n<p>\tInstead, if you set the option &quot;Twitter approvation&quot; to &quot;YES&quot; in the settings page, you&#39;ll see a red icon next to the not-yet-approved users.</p>\n<p>\tTo approve or disapprove a user, just click on the icon in the corresponding row and the status will change automatically. If you disapprove a user, it will be removed from this list, and put automatically in the spam list.</p>\n<p>\tTo change status of more than one user at once, just select the chosen users by clicking on the corresponding checkboxes on the left and then click &quot;sign as spam&quot; on the action bar above to put the selected users into spam list, or on &quot;approve&quot;, to make the selected users&#39; tweets visible on your event page.</p>\n<p>\tTo add a user to the approved list, you can also type the username in the box at the top of the page and then click on &quot;Add&quot;.</p>\n"},{"title": "Mobile browsers management","id": "mobile_browsers_management","content": "<p>\tIn this section you&#39;ll be able to keep up to date the list of the browser used by mobile device.</p>\n<p>\tThis list is very important to make the mobile version working properly. In this list you can add not only browsers names, but also new devices names, as sometimes the mobile devices are not identified just through browsers information, but also through the mobile device general information, such as name.</p>\n<p>\tYou can also delete obsolete browsers if you want, just select the rows you want to remove and click on &quot;Delete&quot; on the action bar above.</p>\n<p>\tThe list provided by default has been updated in July 2012.</p>\n"},{"title": "Public section","id": "public_section","content": "<p>\tPublic section is what your visitors will see.</p>\n<p>\tAccording to what you set in admin panel settings,the first view can be the default calendar for the current month with the current day marked or the event list view.</p>\n<p>\tAs for the default calendar view, the monthly view shows the events per day and clicking on the arrows the user can navigate through months.</p>\n<p>\tClicking on the &quot;LIST&quot; button he can see a list of all the events of the current calendar. By default he will see the present/future events, according to the month he is navigating in, but he&#39;ll be able to select also past events or to choose to see all the calendar events.</p>\n<p>\tOther calendars are available in the drop down at the top right of the screen.</p>\n<p>\tJust passing the mouse over a day he can be shown a preview of available events per day (according to what you previously set in settings area).</p>\n<p>\tClicking on a day, a list of the available events for that day appears.</p>\n<p>\tAs for the list view, the user will see all the events according to the filter you set in admin panel, therefore &quot;future&quot;, &quot;past&quot; or &quot;all&quot;. Future and past events refer to today date.</p>\n<p>\tVisitors can always look for events inserting a text in the &quot;Search for events&quot; field situated at the the top right of the page. The search will be performed in titles and descriptions of all the events into the chosen calendar.</p>\n<p>\tBy clicking on &quot;Read more&quot; button of an event, the user will see the event detail.</p>\n<p>\tIn the event detail there are:</p>\n<p>\t- on the left, all the information about where, when, prices and timetable with a preview of the cover photo and the link to the website of the event, if specified in control panel</p>\n<p>\t- on the right, the event description and the photo gallery, the video, the map, Twitter and Flickr buttons. Plus, the green button that leads to your online store (if specified in control panel)</p>\n<p>\tBy clicking on &quot;Close&quot;, the user will return to the calendar.</p>\n"},{"title": "Mobile","id": "mobile","content": "<p>\tIn &quot;mobile&quot; folder you can find the mobile version of this application.</p>\n<p>\tThis version is automatically displayed when a user lands to your Events Calendar page using a mobile device, if you set this option in the admin panel.</p>\n<p>\tThis version is optimized for mobile devices to make users see the Events Calendar page in the best and clearest way.</p>\n<p>\tYou don&#39;t have to manage also this version, the data are always retrieved from the database, so what you insert in admin panel, will work on both desktop version and mobile version.</p>\n"},{"title": "How to embed the calendar in a custom php page","id": "how_to_embed_the_calendar_in_a_custom_php_page","content": "<div class=\"label_title\">\n\t<div class=\"label_title\">\n\t\t<p style=\"margin-bottom: 0cm\">\n\t\t\tTo embed the calendar in an existing php page follow the guidelines in &quot;index.php&quot; code. You&#39;ll find some comments explaining where you have to put the parts of code (included in this file) in your custom php page.</p>\n\t\t<p style=\"margin-bottom: 0cm\">\n\t\t\tThen copy all the subfolders and files of the &quot;events&quot; folder at the same level of your page, except for &quot;index.php&quot; file.</p>\n\t</div>\n</div>\n"},{"title": "Useful information to know","id": "useful_information_to_know","content": "<p style=\"margin-bottom: 0cm\">\n\t<span lang=\"en-GB\">Actually </span><span lang=\"en-GB\">all the texts are in English, except the email that you can manage in the control panel.</span></p>\n<p style=\"margin-bottom: 0cm\">\n\t<span lang=\"en-GB\">If you want to change the language of the admin panel open the file </span><span lang=\"en-GB\">lang.php in the folder &ldquo;admin/include&rdquo; and carefully change only the texts.</span></p>\n<p style=\"margin-bottom: 0cm\">\n\t<span lang=\"en-GB\">If you want to change the public section language open the file </span><span lang=\"en-GB\">lang.php in the folder &ldquo;include&rdquo; and carefully change only the texts.</span></p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\t***</p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\tAll the graphic files are in a single image called sprite.png that is in the folder events &gt; images.</p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\tTo change Events Calendar graphics colors simply modify the source file in the folder graphic.</p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\tExport the modified file naming it sprite.png and substitute it to the prior file in the folder events &gt; images.</p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\t***</p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\t<strong>For experts.</strong></p>\n<p style=\"margin-bottom: 0cm\">\n\t<span lang=\"en-GB\">Used fonts are Bebas e Cuprum</span><span lang=\"en-GB\">, from fontsquirrel.com.</span></p>\n<p lang=\"en-GB\" style=\"margin-bottom: 0cm\">\n\tIf you want to change them, open the file mainstyle.css in the folder css and change the css rules</p>\n"},{"title": "Events Calendar Versions","id": "events_calendar_versions","content": "<p>\t<strong>Events Calendar 1.3</strong></p>\n<p>\t<strong>Added features:</strong></p>\n<p>\t- recurring events even on specific dates and not only weekly</p>\n<p>\t- event page metatags for SEO management</p>\n<p>\t- admin panel language labels in a unique file to easily change them</p>\n<p>\t- possibility to set the events list view as the default one</p>\n<p>\t- mobile version</p>\n<p>\t<strong>Fixed Bugs:</strong></p>\n<p>\t- timepicker problem in admin panel</p>\n<p>\t- event url address without spaces</p>\n<p>\t- duplicate events error</p>\n<p>\t- list view content</p>\n<p>\t- delete events error</p>\n<p>\t<strong>Events Calendar 1.2</strong></p>\n<p>\t<strong>Added features:</strong></p>\n<p>\t- time format 12/24 hours setting</p>\n<p>\t<strong>Fixed Bug:</strong></p>\n<p>\t- events preview popup bug on mobile devices</p>\n<p>\t- admin area login bug</p>\n<p>\t<strong>Events Calendar 1.1</strong></p>\n<p>\t<strong>Added features:</strong></p>\n<p>\tADMIN</p>\n<p>\t- possibility to add recurring events</p>\n<p>\t- event start time is no longer mandatory</p>\n<p>\tPUBLIC</p>\n<p>\t- events list view</p>\n<p>\t<strong>Fixed Bug:</strong></p>\n<p>\t- delete events bug in admin area</p>\n<p>\t- datepicker bug in admin area</p>\n<p>\t- events search bug in public area</p>\n<p>\t- delete event photos bug in admin area</p>\n"},{"title": "Upgrades","id": "upgrades","content": "<p>\t<strong>From 1.2 to 1.3</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.3, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.3) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n<p>\t- open phpMyAdmin and import the file upgrade_from_1-2_to_1-3.sql (you can find it in the folder upgrade_from_1-2_to_1-3)</p>\n<p>\t<strong>From 1.1 to 1.3</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.3, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.3) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n<p>\t- open phpMyAdmin and import the file upgrade_from_1-1_to_1-3.sql (you can find it in the folder upgrade_from_1-1_to_1-3)</p>\n<p>\t<strong>From 1.0 to 1.3</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.3, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.3) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n<p>\t- open phpMyAdmin and import the file upgrade_from_1-0_to_1-3.sql (you can find it in the folder upgrade_from_1-0_to_1-3)</p>\n<p>\t<strong>From 1.1 to 1.2</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.2, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.2) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n<p>\t- open phpMyAdmin and import the file upgrade_from_1-1_to_1-2.sql (you can find it in the folder upgrade_from_1-1_to_1-2)</p>\n<p>\t<strong>From 1.0 to 1.2</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.2, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.2) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n<p>\t- open phpMyAdmin and import the file upgrade_from_1-0_to_1-2.sql (you can find it in the folder upgrade_from_1-0_to_1-2)</p>\n<p>\t<strong>From 1.0 to 1.1</strong></p>\n<p>\tTo upgrade to Events Calendar version 1.1, follow these simple steps:</p>\n<p>\t- backup the events folder, for good measure, before proceeding with the upgrade.</p>\n<p>\t- copy and overwrite the events folder (version 1.1) into the events folder of the previous version, except the file named db_conn.php (you can find it in events &gt; admin &gt; include)</p>\n<p>\tPay attention: if you have modified the code or the graphic, after the overwriting, modification will be deleted and you will have to enter them again.</p>\n"}],"use_sub": true,"logo": "","favicon": "","customcss": "","easing": "swing","easingduration": "500","bgimage": "","bgrepeat": "repeat","bgattachment": "scroll","bgcolor": "FFFFFF","textcolor": "383838","linkcolor": "0000FF","hrcolor1": "EBEBEB","hrcolor2": "FFFFFF","sidebarbgimage": "","sidebarbgrepeat": "repeat","sidebarbgcolor": "DDDDDD","sidebartextcolor": "222222","sidebarlinkcolor": "444444","sidebaractivecolor": "444444","sidebaractivetextcolor": "DDDDDD","sidebarhrcolor1": "AAAAAA","sidebarhrcolor2": "EEEEEE","cufon": "","itemURL": "","sendJSON": "","sendZIP": "","sendPWD": ""}